Repository: Acidburn0zzz/pkgbuilder
Catalog: locale/*/LC_MESSAGES/pkgbuilder.po
Languages: vi

source: Validating installation status...
vi: Đang kiểm tra trạng thái cài đặt...

source: {0}: not an AUR package
vi: {0}: không phải gói cài đặt dạng AUR

source: {0}: installed {1}
vi: {0}: đã cài đặt {1}

source: {0}: NOT installed
vi: {0}: CHƯA được cài đặt

source: {0}: outdated {1}
vi: {0}: quá hạn {1}

source: Installing built packages...
vi: Đang cài đặt các gói dữ liệu...

source: Fetching package information...
vi: Đang tải về thông tin của gói cài đặt...

source: Downloading the tarball...
vi: Đang tải về các tập tin tarball...

source: {0} kB downloaded
vi: {0} kB đã tải về

source: Extracting...
vi: Đang giải nén..

source: {0} files extracted
vi: {0} tập tin đã giải nén

source: Building {0}...
vi: Đang xây dựng {0}...

source: Performing a safe upgrade as root!
vi: Đang tiến hành việc nâng cấp an toàn dưới quyền root!

source: It is recommended to restart PKGBUILDer as a regular user instead.
vi: Bạn nên khởi động lại PKGBUILDer dưới dạng người dùng thông thường.

source: Build finished with return code {0}.
vi: Phần xây dựng đã hoàn tất với mã trả về {0}.

source: The build function reported a proper build.
vi: Hàm phát triển dữ liệu đã gửi báo cáo phần phát triển cấp cao hơn.

source: Building more AUR packages is required.
vi: Yêu cầu việc xây dựng thêm nhiều gói tin AUR.

source: found an existing package for {0}
vi: đã tìm thấy gói cài đặt hiện đang tồn tại cho {0}

source: makepkg (or someone else) failed and returned {0}.
vi: makepkg (hoặc đối tượng nào đó) đã thất bại và trả về {0}.

source: 0 bytes downloaded
vi: 0 byte đã tải về

source: No files extracted.
vi: Vẫn chưa giải nén tập tin nào.

source: Failed to fulfill package dependency requirement: {0}
vi: Thất bại trong việc điền vào các yêu cầu về sự phụ thuộc của gói tin: {0}

source: :: Retrieving packages from abs...
vi: :: Đang nhận các gói cài đặt từ abs..

source: retrieving {0}
vi: đang nhận {0}

source: Failed to retieve {0} (from ABS/rsync).
vi: Thất bại khi nhận {0} (từ ABS/rsync).

source: :: Retrieving packages from aur...
vi: :: Đang nhận các gói cài đặt từ aur...

source: Extracting AUR packages...
vi: Đang giải nén các gói cài đặt AUR...

source: Successfully fetched:
vi: Đã tải về thành công:

source: Retrieving from ABS...
vi: Đang nhận từ ABS...

source: Checking dependencies...
vi: Đang kiểm tra tính độc lập...

source: found in system
vi: đã được tìm thấy trong hệ thống

source: found in repos
vi: đã được tìm thấy trong repos

source: found in the AUR
vi: đã được tìm thấy trong AUR

source: none found
vi: không tìm thấy

source: AUR Error: {0}
vi: Lỗi AUR: {0}

source: makepkg returned {0}.
vi: makepkg trả về {0}.

source: Network error: {0} (via {1})
vi: Lỗi mạng lưới: {0} (thông qua {1})

source: Connection error: {0} (via {1})
vi: Lỗi kết nối: {0} (thông qua {1})

source: HTTP Error {0} (via {1})
vi: Lỗi HTTP {0} (thông qua {1})

source: {0} (Package: {1})
vi: {0} (Gói cài đặt: {1})

source: Package {0} not found. (via {1})
vi: Gói cài đặt {0} không được tìm thấy. (thông qua {1})

source: Sanity error! {0} (via {1})
vi: Lỗi nghiêm trọng! {0} (thông qua {1})

source: LANG locale by AUTHOR <MAIL@IF.YOU.WANT>
vi: Được chuyển ngữ bởi tác giả <MAIL@IF.YOU.WANT>

source: An AUR helper (and library) in Python 3.
vi: Tập tin trợ giúp AUR (và thư viện) ở định dạng Pythong 3

source: Also accepting ABS packages.
vi: Chấp nhaạn gói cài đặt ABS.

source: show version number and quit
vi: hiển thị số phiên bản và thoát

source: PACKAGE
vi: GÓI CÀI ĐẶT

source: AUR/ABS packages to build
vi: Gói cài đặt AUR/ABS để xây dựng

source: operations
vi: tiến trình

source: fetch package files
vi: tải các tập tin gói cài đặt

source: view package information
vi: xem thông tin gói cài đặt

source: search the AUR for matching strings
vi: tìm kiếm các chuỗi khớp với AUR

source: upgrade installed AUR packages
vi: nâng cấp các gói cài đặt AUR đã cài

source: perform a failsafe upgrade of PKGBUILDer
vi: thực hiện việc nâng cấp dự phòng PKGBUILDer

source: options
vi: tùy chọn

source: clean up work files after build
vi: xóa các tập tin sau khi đã xây dựng xong

source: don't use colors in output
vi: không sử dụng chế độ hiển thị màu với dữ liệu xuất ra

source: display debug messages
vi: hiển thị thông tin gỡ rối

source: don't check dependencies (may break makepkg)
vi: không kiểm tra tính độc lập (có thể phá bỏ makepkg)

source: upgrade all the VCS/date-versioned packages
vi: nâng cấp tất cả các gói cài đặt VCS/date-versioned

source: don't check if packages were installed after build
vi: không kiểm tra nếu gói cài đặt được cài đặt sau khi xây dựng

source: pacman-like mode
vi: chế độ pacman-like

source: Search query too short
vi: Truy vấn tìm kiếm quá ngắn

source: Searching for exact match...
vi: Đang tìm kiếm dữ liệu khớp...

source: not found
vi: không tìm thấy

source: PKGBUILDer Failsafe Upgrade
vi: Nâng cấp PKGBUILDer dự phòng

source: Build the git version? [y/N]
vi: Xây dựng phiên bản git? [y/N]

source: Running PKGBUILDer as root can break your system!
vi: Chạy PKGBUILDer dưới dạng root có thể phá hỏng hệ thống của bạn!

source: PKGBUILDer (or the requests library) had problems with fulfilling an HTTP request.
vi: PKGBUILDer (hoặc thư viện xử lý yêu cầu) gặp trục trặc khi xử lý các yêu cầu HTTP.

source: Aborted by user! Exiting...
vi: Được hủy bởi người dùng! Đang thoát...

source: Interrupt signal received
vi: Đã nhận tín hiệu ngắt

source: ERROR:
vi: LỖI:

source: Cannot create the configuration directory.
vi: Không thể tạo thư mục cấu hình.

source: WARNING:
vi: CẢNH BÁO:

source: Logs will not be created.
vi: Nhật ký sẽ không được tạo.

source: Initializing pacman access...
vi: Đang thiết lập truy cập pacman...

source: Synchronizing package databases...
vi: Đang đồng bộ hóa cơ sở dữ liệu gói cài đặt...

source: Starting full system upgrade...
vi: Đang bắt đầu cập nhật toàn bộ hệ thống...

source: {0}: local ({1}) is newer than aur ({2})
vi: {0}: hiện tại ({1}) mới hơn aur ({2})

source: there is nothing to do
vi: không có thao tác nào được thực hiện

source: The following packages should be upgraded first:
vi: Các gói tin sau đây nên được nâng cấp đầu tiên:

source: Do you want to cancel the current operation
vi: Bạn có muốn hủy bỏ tiến trình hiện tại

source: and upgrade these packages now? [Y/n]
vi: và cập nhật các gói cài đặt ngay bây giờ? [Y/n]

source: Do you want to cancel the current operation and upgrade these packages now? [Y/n]
vi: Bạn có muốn hủy bỏ tiến trình hiện tại và cập nhật các gói cài đặt này ngay bây giờ? [Y/n]

source: Targets ({0}):
vi: Mục tiêu ({0}):

source: Name
vi: Tên

source: Old Version
vi: Phiên bản cũ

source: New Version
vi: Phiên bản mới

source: warning: insufficient columns available for table display
vi: cảnh báo: các cột hiển thị cho thông tin về bảng dữ liệu hiện bị lỗi

source: Proceed with installation? [Y/n]
vi: Tiếp tục cài đặt? [Y/n]

source: [installed: {0}]
vi: [đã cài đặt: {0}]

source: [installed]
vi: [đã cài đặt]

source: [out of date]
vi: [đã quá hạn]

source: votes
vi: bình chọn

source: Didn’t pass any packages.
vi: Vẫn chưa thông qua gói cài đặt nào.

source: Trying to use utils.print_package_info with an ABS package
vi: Đang cố sử dụng utils.print_package_info với gói cài đặt ABS

source: yes
vi: có

source: no
vi: không

source: usage: {0} <operation> [...] PBWrapper, a wrapper for pacman and PKGBUILDer. {1} Pacman and PKGBUILDer syntaxes apply. Consult their manpages/help commands for more details. Additional options: -L, --unlock unlock the pacman database
vi: cách dùng: {0} <tiến trình> [...] PBWrapper, là wrapper dành cho pacman và PKGBUILDer. {1} Chỉ áp dụng cho cú pháp thuộc Pacman và PKGBUILDer. Tra cứu các văn bản/lệnh trợ giúp để biết thêm chi tiết. Tùy chọn bổ sung: -L, --unlock mở khóa phần cơ sở dữ liệu của pacman

source: Performing a dependency check...
vi: Đang thực hiện việc kiểm tra độc lập...

source: found
vi: đã tìm thấy

source: Something went wrong. Please read makepkg's output and try again. You can also try to debug the work of this script yourself. All the files this script was working on are placed in {0} (the number is random). If I am wrong, though, congratulations!
vi: Đã xảy ra lỗi. Vùi lòng đọc dữ liệu xuất ra của makepkg và thử lại lần nữa. Bạn cũng có thể tự mình sửa các gỡ rối dựa vào đoạn mã lênh này theo ý bạn. Tất cả các tập tin mà đoạn mã lệnh này tác động tới được đặt ở {0} (con số này là ngẫu nhiên). Nếu như lỗi này thuộc về nhà phát triển, bạn hãy liên hệ với chúng tôi!

source: Hello! PKGBUILDer is now available as an AUR package. It is the suggested way of installing PKGBUILDer. This script will download the AUR package and install it. If you will have problems, please download and compile the package manually.
vi: Xin chào! PKGBUILDer hiện là gói cài đặt AUR. Đây hiện là cách cài đặt được khuyên dùng đối với PKGBUILDer. Phần mã lệnh này sẽ tải về gói tin AUR và tiến hành cài đặt. Nếu gặp phải trục trặc, xin vui lòng tải về và biên dịch các gói tin một cách tuần tự.

source: Hit Enter/Return to continue.
vi: Ấn Enter/Return để tiếp tục.

source: Installing missing AUR dependencies...
vi: Đang cài đặt các phần AUR độc lập còn thiếu...

source: Read the above output. If the script had any problems, run it again. You can also try to debug the work of this script yourself. All the files this script was working on are placed in {0} (the number is random). If everything went fine, though, congratulations! You can now use PKGBUILDer. For standalone usage, type `pkgbuilder` into the prompt (zsh users: hash -r, other shells may need another command). For python module usage, type `import pkgbuilder` into the python prompt.
vi: Đọc phần dữ liệu được xuất ra bên trên. Nếu các đoạn mã lệnh gặp vấn đề, hãy chạy lại các đoạn mã lệnh này một lần nữa. Bạn cũng có thể tự mình sửa phần gỡ rối này. Tất cả các tập tin mà đoạn mã lệnh này tác động tới được đặt ở {0} (con số này là ngẫu nhiên). INếu như lỗi này thuộc về nhà phát triển, bạn hãy liên hệ với chúng tôi! Bạn hiện giờ đã có thể sử dụng PKGBUILDer. Đối với kiểu dùng theo dạng tập tin tự chay, gõ `pkgbuilder` vào trong cửa sổ mã lệnh (người dùng zsh: hash -r, các shell khác sẽ cần thêm một dòng lệnh nữa). Đối với cách sử dụng module Python, gõ `import pkgbuilder` vào trong cửa sổ mã lệnh của python.

source: It looks like you want to quit. Okay then, goodbye. No work has been started yet. If that's what you want to do, go for it. If it isn't, run this script again.
vi: Có vẻ như bạn muốn thoát. Nếu thế thì, chào tạm biệt. Hiện các công việc vẫn chưa được thực hiện. Nếu đây là điều bạn muốn, xin cứ tiếp tục. Nếu không phải, hãy thực thi đoạn mã lệnh này lần nữa.

source: It looks like you want to quit. Okay then, goodbye. All the files this script was working on are placed in {0} (the number is random). If that's what you want to do, go for it. If it isn't, run this script again.
vi: Có vẻ như bạn đang muốn thoát. Nếu vậy, xin chào tạm biệt. Tất cả các tập tin mà đoạn mã lệnh này tác động tới được đặt ở {0} (con số này là ngẫu nhiên). Nếu đó là điều bạn muốn thao tác, cứ tiếp tục. Nếu không phải, chạy lại đoạn mã này một lần nữa.

source: usage
vi: cách dùng

source: positional arguments
vi: vị trí đối số

source: optional arguments
vi: tùy chọn đối số

source: show this help message and exit
vi: hiển thị thông điệp trợ giúp và thoát
